#+TITLE: Using APIServer logs to find per audit_entry operation_id
** retrive logs locally for jq and grepping
#+NAME: retrieve kube-apiserver.log
#+BEGIN_SRC shell :results silent
wget https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1166724892536606720/artifacts/bootstrap-e2e-master/kube-apiserver.log
#+END_SRC

#+NAME: retriev some of the audit-log
#+BEGIN_SRC shell :results silent
wget https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1166724892536606720/artifacts/bootstrap-e2e-master/kube-apiserver-audit.log
wget https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1166724892536606720/artifacts/bootstrap-e2e-master/kube-apiserver-audit.log-20190828-1567005305.gz
wget https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1166724892536606720/artifacts/bootstrap-e2e-master/kube-apiserver-audit.log-20190828-1567004705.gzyy
#+END_SRC






#+NAME: grab the first audit entry
#+BEGIN_SRC shell :wrap "SRC json"
zcat kube-apiserver-audit.log-20190828-1567004705.gz | head -1 | jq .
# head -1 kube-apiserver-audit.log | jq .
#+END_SRC

#+RESULTS: grab the first audit entry
#+begin_SRC json
{
  "kind": "Event",
  "apiVersion": "audit.k8s.io/v1",
  "level": "Request",
  "auditID": "6dfb7495-7cae-44d7-a341-b71676ce2a11",
  "stage": "ResponseComplete",
  "requestURI": "/api/v1/namespaces/kube-system/pods/kube-controller-manager-bootstrap-e2e-master",
  "verb": "get",
  "user": {
    "username": "kubelet",
    "groups": [
      "system:nodes",
      "system:authenticated"
    ]
  },
  "sourceIPs": [
    "35.199.181.20"
  ],
  "userAgent": "kubelet/v1.17.0 (linux/amd64) kubernetes/bdfc8f6",
  "objectRef": {
    "resource": "pods",
    "namespace": "kube-system",
    "name": "kube-controller-manager-bootstrap-e2e-master",
    "apiVersion": "v1"
  },
  "responseStatus": {
    "metadata": {},
    "status": "Failure",
    "reason": "Forbidden",
    "code": 403
  },
  "requestReceivedTimestamp": "2019-08-28T14:55:57.145668Z",
  "stageTimestamp": "2019-08-28T14:55:57.145880Z",
  "annotations": {
    "authorization.k8s.io/decision": "forbid",
    "authorization.k8s.io/reason": ""
  }
}
#+end_SRC

#+NAME: locate that audit entry in the apiserver log
#+BEGIN_SRC bash
    (
    grep '/api/v1/namespaces/kube-system/pods/kube-controller-manager-bootstrap-e2e-master' kube-apiserver.log | head -2
    #grep '/api/v1/namespaces/provisioning-6344/pods/pod-subpath-test-local-preprovisionedpv-rxm2' kube-apiserver.log
    ) 2>&1
    :
#+END_SRC

#+RESULTS: locate that audit entry in the apiserver log
#+begin_EXAMPLE
I0828 14:55:57.145739       1 authorization.go:73] Forbidden: "/api/v1/namespaces/kube-system/pods/kube-controller-manager-bootstrap-e2e-master", Reason: ""
I0828 14:55:57.146315       1 httplog.go:90] GET /api/v1/namespaces/kube-system/pods/kube-controller-manager-bootstrap-e2e-master: (1.172823ms) 403 [kubelet/v1.17.0 (linux/amd64) kubernetes/bdfc8f6 35.199.181.20:51066]
#+end_EXAMPLE

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE

